PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p18f85j94.inc
;----- RPINR10_11 Bits -----------------------------------------------------
SS1R0            EQU  H'0000'
SS1R1            EQU  H'0001'
SS1R2            EQU  H'0002'
SS1R3            EQU  H'0003'
SCK2R0           EQU  H'0004'
SCK2R1           EQU  H'0005'
SCK2R2           EQU  H'0006'
SCK2R3           EQU  H'0007'


;----- RPINR12_13 Bits -----------------------------------------------------
SDI2R0           EQU  H'0000'
SDI2R1           EQU  H'0001'
SDI2R2           EQU  H'0002'
SDI2R3           EQU  H'0003'
SS2R0            EQU  H'0004'
SS2R1            EQU  H'0005'
SS2R2            EQU  H'0006'
SS2R3            EQU  H'0007'


;----- RPINR14_15 Bits -----------------------------------------------------
FLT0R0           EQU  H'0000'
FLT0R1           EQU  H'0001'
FLT0R2           EQU  H'0002'
FLT0R3           EQU  H'0003'
ECCP1R0          EQU  H'0004'
ECCP1R1          EQU  H'0005'
ECCP1R2          EQU  H'0006'
ECCP1R3          EQU  H'0007'


;----- RPINR16_17 Bits -----------------------------------------------------
ECCP2R0          EQU  H'0000'
ECCP2R1          EQU  H'0001'
ECCP2R2          EQU  H'0002'
ECCP2R3          EQU  H'0003'
ECCP3R0          EQU  H'0004'
ECCP3R1          EQU  H'0005'
ECCP3R2          EQU  H'0006'
ECCP3R3          EQU  H'0007'


;----- RPINR18_19 Bits -----------------------------------------------------
IOC0R0           EQU  H'0000'
IOC0R1           EQU  H'0001'
IOC0R2           EQU  H'0002'
IOC0R3           EQU  H'0003'
IOC1R0           EQU  H'0004'
IOC1R1           EQU  H'0005'
IOC1R2           EQU  H'0006'
IOC1R3           EQU  H'0007'


;----- RPINR20_21 Bits -----------------------------------------------------
IOC2R0           EQU  H'0000'
IOC2R1           EQU  H'0001'
IOC2R2           EQU  H'0002'
IOC2R3           EQU  H'0003'
IOC3R0           EQU  H'0004'
IOC3R1           EQU  H'0005'
IOC3R2           EQU  H'0006'
IOC3R3           EQU  H'0007'


;----- RPINR22_23 Bits -----------------------------------------------------
IOC4R0           EQU  H'0000'
IOC4R1           EQU  H'0001'
IOC4R2           EQU  H'0002'
IOC4R3           EQU  H'0003'
IOC5R0           EQU  H'0004'
IOC5R1           EQU  H'0005'
IOC5R2           EQU  H'0006'
IOC5R3           EQU  H'0007'


;----- RPINR24_25 Bits -----------------------------------------------------
IOC6R0           EQU  H'0000'
IOC6R1           EQU  H'0001'
IOC6R2           EQU  H'0002'
IOC6R3           EQU  H'0003'
IOC7R0           EQU  H'0004'
IOC7R1           EQU  H'0005'
IOC7R2           EQU  H'0006'
IOC7R3           EQU  H'0007'


;----- RPINR26_27 Bits -----------------------------------------------------
INT1R0           EQU  H'0000'
INT1R1           EQU  H'0001'
INT1R2           EQU  H'0002'
INT1R3           EQU  H'0003'
INT2R0           EQU  H'0004'
INT2R1           EQU  H'0005'
INT2R2           EQU  H'0006'
INT2R3           EQU  H'0007'


;----- RPINR28_29 Bits -----------------------------------------------------
INT3R0           EQU  H'0000'
INT3R1           EQU  H'0001'
INT3R2           EQU  H'0002'
INT3R3           EQU  H'0003'
MDMINR0          EQU  H'0004'
MDMINR1          EQU  H'0005'
MDMINR2          EQU  H'0006'
MDMINR3          EQU  H'0007'


;----- RPINR30_31 Bits -----------------------------------------------------
MDCIN1R0         EQU  H'0000'
MDCIN1R1         EQU  H'0001'
MDCIN1R2         EQU  H'0002'
MDCIN1R3         EQU  H'0003'
MDCIN2R0         EQU  H'0004'
MDCIN2R1         EQU  H'0005'
MDCIN2R2         EQU  H'0006'
MDCIN2R3         EQU  H'0007'


;----- RPINR32_33 Bits -----------------------------------------------------
CCP4R0           EQU  H'0000'
CCP4R1           EQU  H'0001'
CCP4R2           EQU  H'0002'
CCP4R3           EQU  H'0003'
CCP5R0           EQU  H'0004'
CCP5R1           EQU  H'0005'
CCP5R2           EQU  H'0006'
CCP5R3           EQU  H'0007'


;----- RPINR34_35 Bits -----------------------------------------------------
CCP6R0           EQU  H'0000'
CCP6R1           EQU  H'0001'
CCP6R2           EQU  H'0002'
CCP6R3           EQU  H'0003'
CCP7R0           EQU  H'0004'
CCP7R1           EQU  H'0005'
CCP7R2           EQU  H'0006'
CCP7R3           EQU  H'0007'


;----- RPINR36_37 Bits -----------------------------------------------------
CCP8R0           EQU  H'0000'
CCP8R1           EQU  H'0001'
CCP8R2           EQU  H'0002'
CCP8R3           EQU  H'0003'
CCP9R0           EQU  H'0004'
CCP9R1           EQU  H'0005'
CCP9R2           EQU  H'0006'
CCP9R3           EQU  H'0007'


;----- RPINR38_39 Bits -----------------------------------------------------
CCP10R0          EQU  H'0000'
CCP10R1          EQU  H'0001'
CCP10R2          EQU  H'0002'
CCP10R3          EQU  H'0003'
T0CKIR0          EQU  H'0004'
T0CKIR1          EQU  H'0005'
T0CKIR2          EQU  H'0006'
T0CKIR3          EQU  H'0007'


;----- RPINR40_41 Bits -----------------------------------------------------
T1GR0            EQU  H'0000'
T1GR1            EQU  H'0001'
T1GR2            EQU  H'0002'
T1GR3            EQU  H'0003'
T1CKIR0          EQU  H'0004'
T1CKIR1          EQU  H'0005'
T1CKIR2          EQU  H'0006'
T1CKIR3          EQU  H'0007'


;----- RPINR42_43 Bits -----------------------------------------------------
T3GR0            EQU  H'0000'
T3GR1            EQU  H'0001'
T3GR2            EQU  H'0002'
T3GR3            EQU  H'0003'
T3CKIR0          EQU  H'0004'
T3CKIR1          EQU  H'0005'
T3CKIR2          EQU  H'0006'
T3CKIR3          EQU  H'0007'


;----- RPINR44_45 Bits -----------------------------------------------------
T5GR0            EQU  H'0000'
T5GR1            EQU  H'0001'
T5GR2            EQU  H'0002'
T5GR3            EQU  H'0003'
T5CKIR0          EQU  H'0004'
T5CKIR1          EQU  H'0005'
T5CKIR2          EQU  H'0006'
T5CKIR3          EQU  H'0007'


;----- RPINR46_47 Bits -----------------------------------------------------
PBIO0R0          EQU  H'0000'
PBIO0R1          EQU  H'0001'
PBIO0R2          EQU  H'0002'
PBIO0R3          EQU  H'0003'
PBIO1R0          EQU  H'0004'
PBIO1R1          EQU  H'0005'
PBIO1R2          EQU  H'0006'
PBIO1R3          EQU  H'0007'


;----- RPINR48_49 Bits -----------------------------------------------------
PBIO2R0          EQU  H'0000'
PBIO2R1          EQU  H'0001'
PBIO2R2          EQU  H'0002'
PBIO2R3          EQU  H'0003'
PBIO3R0          EQU  H'0004'
PBIO3R1          EQU  H'0005'
PBIO3R2          EQU  H'0006'
PBIO3R3          EQU  H'0007'


;----- RPINR50_51 Bits -----------------------------------------------------
PBIO4R0          EQU  H'0000'
PBIO4R1          EQU  H'0001'
PBIO4R2          EQU  H'0002'
PBIO4R3          EQU  H'0003'
PBIO5R0          EQU  H'0004'
PBIO5R1          EQU  H'0005'
PBIO5R2          EQU  H'0006'
PBIO5R3          EQU  H'0007'


;----- RPINR52_53 Bits -----------------------------------------------------
PBIO6R0          EQU  H'0000'
PBIO6R1          EQU  H'0001'
PBIO6R2          EQU  H'0002'
PBIO6R3          EQU  H'0003'
PBIO7R0          EQU  H'0004'
PBIO7R1          EQU  H'0005'
PBIO7R2          EQU  H'0006'
PBIO7R3          EQU  H'0007'


;----- ANCON3 Bits -----------------------------------------------------
ANSEL16          EQU  H'0000'
ANSEL17          EQU  H'0001'
ANSEL18          EQU  H'0002'
ANSEL19          EQU  H'0003'
ANSEL20          EQU  H'0004'
ANSEL21          EQU  H'0005'
ANSEL22          EQU  H'0006'
ANSEL23          EQU  H'0007'


;----- ANCON2 Bits -----------------------------------------------------
ANSEL8           EQU  H'0000'
ANSEL9           EQU  H'0001'
ANSEL10          EQU  H'0002'
ANSEL11          EQU  H'0003'
ANSEL12          EQU  H'0004'
ANSEL13          EQU  H'0005'
ANSEL14          EQU  H'0006'
ANSEL15          EQU  H'0007'


;----- ANCON1 Bits -----------------------------------------------------
ANSEL0           EQU  H'0000'
ANSEL1           EQU  H'0001'
ANSEL2           EQU  H'0002'
ANSEL3           EQU  H'0003'
ANSEL4           EQU  H'0004'
ANSEL5           EQU  H'0005'
ANSEL6           EQU  H'0006'
ANSEL7           EQU  H'0007'


;----- ADCTMUEN0L Bits -----------------------------------------------------
CTMUEN0          EQU  H'0000'
CTMUEN1          EQU  H'0001'
CTMUEN2          EQU  H'0002'
CTMUEN3          EQU  H'0003'
CTMUEN4          EQU  H'0004'
CTMUEN5          EQU  H'0005'
CTMUEN6          EQU  H'0006'
CTMUEN7          EQU  H'0007'


