PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p18f85j94.inc
;----- ECCP3DEL Bits -----------------------------------------------------
P3RSEN           EQU  H'0007'

P3DC0            EQU  H'0000'
P3DC1            EQU  H'0001'
P3DC2            EQU  H'0002'
P3DC3            EQU  H'0003'
P3DC4            EQU  H'0004'
P3DC5            EQU  H'0005'
P3DC6            EQU  H'0006'


;----- ECCP3AS Bits -----------------------------------------------------
ECCP3ASE         EQU  H'0007'

PSS3BD0          EQU  H'0000'
PSS3BD1          EQU  H'0001'
PSS3AC0          EQU  H'0002'
PSS3AC1          EQU  H'0003'
ECCP3AS0         EQU  H'0004'
ECCP3AS1         EQU  H'0005'
ECCP3AS2         EQU  H'0006'


;----- CCP2CON Bits -----------------------------------------------------
CCP2M0           EQU  H'0000'
CCP2M1           EQU  H'0001'
CCP2M2           EQU  H'0002'
CCP2M3           EQU  H'0003'
DC2B0            EQU  H'0004'
DC2B1            EQU  H'0005'
P2M0             EQU  H'0006'
P2M1             EQU  H'0007'

CCP2Y            EQU  H'0004'
CCP2X            EQU  H'0005'


;----- ECCP2DEL Bits -----------------------------------------------------
P2RSEN           EQU  H'0007'

P2DC0            EQU  H'0000'
P2DC1            EQU  H'0001'
P2DC2            EQU  H'0002'
P2DC3            EQU  H'0003'
P2DC4            EQU  H'0004'
P2DC5            EQU  H'0005'
P2DC6            EQU  H'0006'


;----- ECCP2AS Bits -----------------------------------------------------
ECCP2ASE         EQU  H'0007'

PSS2BD0          EQU  H'0000'
PSS2BD1          EQU  H'0001'
PSS2AC0          EQU  H'0002'
PSS2AC1          EQU  H'0003'
ECCP2AS0         EQU  H'0004'
ECCP2AS1         EQU  H'0005'
ECCP2AS2         EQU  H'0006'


;----- CM1CON Bits -----------------------------------------------------
CREF             EQU  H'0002'
CPOL             EQU  H'0005'
COE              EQU  H'0006'
CON              EQU  H'0007'

CCH0             EQU  H'0000'
CCH1             EQU  H'0001'
EVPOL0           EQU  H'0003'
EVPOL1           EQU  H'0004'


;----- PADCFG1 Bits -----------------------------------------------------
RLPU             EQU  H'0000'
RKPU             EQU  H'0001'
RJPU             EQU  H'0002'
RHPU             EQU  H'0003'
RGPU             EQU  H'0004'
RFPU             EQU  H'0005'
REPU             EQU  H'0006'
RDPU             EQU  H'0007'


;----- IOCN Bits -----------------------------------------------------
IOCN0            EQU  H'0000'
IOCN1            EQU  H'0001'
IOCN2            EQU  H'0002'
IOCN3            EQU  H'0003'
IOCN4            EQU  H'0004'
IOCN5            EQU  H'0005'
IOCN6            EQU  H'0006'
IOCN7            EQU  H'0007'


;----- IOCP Bits -----------------------------------------------------
IOCP0            EQU  H'0000'
IOCP1            EQU  H'0001'
IOCP2            EQU  H'0002'
IOCP3            EQU  H'0003'
IOCP4            EQU  H'0004'
IOCP5            EQU  H'0005'
IOCP6            EQU  H'0006'
IOCP7            EQU  H'0007'


;----- RTCCON2 Bits -----------------------------------------------------
PWCSPRE          EQU  H'0004'
PWCCPRE          EQU  H'0005'
PWCPOL           EQU  H'0006'
PWCEN            EQU  H'0007'

RTCSECSEL0       EQU  H'0000'
RTCSECSEL1       EQU  H'0001'
RTCCLKSEL0       EQU  H'0002'
RTCCLKSEL1       EQU  H'0003'


;----- ALRMRPT Bits -----------------------------------------------------
ARPT0            EQU  H'0000'
ARPT1            EQU  H'0001'
ARPT2            EQU  H'0002'
ARPT3            EQU  H'0003'
ARPT4            EQU  H'0004'
ARPT5            EQU  H'0005'
ARPT6            EQU  H'0006'
ARPT7            EQU  H'0007'


;----- ALRMCFG Bits -----------------------------------------------------
CHIME            EQU  H'0006'
ALRMEN           EQU  H'0007'

ALRMPTR0         EQU  H'0000'
ALRMPTR1         EQU  H'0001'
AMASK0           EQU  H'0002'
AMASK1           EQU  H'0003'
AMASK2           EQU  H'0004'
AMASK3           EQU  H'0005'


;----- RTCCAL Bits -----------------------------------------------------
CAL0             EQU  H'0000'
CAL1             EQU  H'0001'
CAL2             EQU  H'0002'
CAL3             EQU  H'0003'
CAL4             EQU  H'0004'
CAL5             EQU  H'0005'
CAL6             EQU  H'0006'
CAL7             EQU  H'0007'


;----- RTCCON1 Bits -----------------------------------------------------
RTCOE            EQU  H'0002'
HALFSEC          EQU  H'0003'
RTCSYNC          EQU  H'0004'
RTCWREN          EQU  H'0005'
RTCEN            EQU  H'0007'

RTCPTR0          EQU  H'0000'
RTCPTR1          EQU  H'0001'


;----- DMACON1 Bits -----------------------------------------------------
DMAEN            EQU  H'0000'
DLYINTEN         EQU  H'0001'
RXINC            EQU  H'0004'
TXINC            EQU  H'0005'

DUPLEX0          EQU  H'0002'
DUPLEX1          EQU  H'0003'
SSCON0           EQU  H'0006'
SSCON1           EQU  H'0007'


;----- PIE6 Bits -----------------------------------------------------
CMP1IE           EQU  H'0000'
CMP2IE           EQU  H'0001'
CMP3IE           EQU  H'0002'
TX3IE            EQU  H'0004'
RC3IE            EQU  H'0005'
TX4IE            EQU  H'0006'
RC4IE            EQU  H'0007'


;----- WPUB Bits -----------------------------------------------------
WPUB0            EQU  H'0000'
WPUB1            EQU  H'0001'
WPUB2            EQU  H'0002'
WPUB3            EQU  H'0003'
WPUB4            EQU  H'0004'
WPUB5            EQU  H'0005'
WPUB6            EQU  H'0006'
WPUB7            EQU  H'0007'


;----- ACTCON Bits -----------------------------------------------------
ACTORSPOL        EQU  H'0000'
ACTORS           EQU  H'0001'
ACTLOCKPOL       EQU  H'0002'
ACTLOCK          EQU  H'0003'
ACTSRC           EQU  H'0004'
ACTSIDL          EQU  H'0005'
ACTEN            EQU  H'0007'


;----- OSCCON4 Bits -----------------------------------------------------
PLLEN            EQU  H'0005'

CPDIV0           EQU  H'0006'
CPDIV1           EQU  H'0007'


;----- OSCCON3 Bits -----------------------------------------------------
IRCF0            EQU  H'0000'
IRCF1            EQU  H'0001'
IRCF2            EQU  H'0002'


;----- OSCCON2 Bits -----------------------------------------------------
SOSCGO           EQU  H'0001'
POSCEN           EQU  H'0002'
CF               EQU  H'0003'
LOCK             EQU  H'0005'
IOLOCK           EQU  H'0006'
CLKLOCK          EQU  H'0007'


;----- BAUDCON Bits -----------------------------------------------------
ABDEN            EQU  H'0000'
WUE              EQU  H'0001'
IREN             EQU  H'0002'
BRG16            EQU  H'0003'
TXCKP            EQU  H'0004'
RXDTP            EQU  H'0005'
RCIDL            EQU  H'0006'
ABDOVF           EQU  H'0007'

CKTXP            EQU  H'0004'
DTRXP            EQU  H'0005'

