PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p18f85j94.inc
SCKP             EQU  H'0004'
RCMT             EQU  H'0006'


;----- BAUDCON1 Bits -----------------------------------------------------
ABDEN            EQU  H'0000'
WUE              EQU  H'0001'
IREN             EQU  H'0002'
BRG16            EQU  H'0003'
TXCKP            EQU  H'0004'
RXDTP            EQU  H'0005'
RCIDL            EQU  H'0006'
ABDOVF           EQU  H'0007'

CKTXP            EQU  H'0004'
DTRXP            EQU  H'0005'

SCKP             EQU  H'0004'
RCMT             EQU  H'0006'


;----- SSP1MSK Bits -----------------------------------------------------
MSK0             EQU  H'0000'
MSK1             EQU  H'0001'
MSK2             EQU  H'0002'
MSK3             EQU  H'0003'
MSK4             EQU  H'0004'
MSK5             EQU  H'0005'
MSK6             EQU  H'0006'
MSK7             EQU  H'0007'


;----- SSP1CON3 Bits -----------------------------------------------------
DHEN             EQU  H'0000'
AHEN             EQU  H'0001'
SBCDE            EQU  H'0002'
SDAHT            EQU  H'0003'
BOEN             EQU  H'0004'
SCIE             EQU  H'0005'
PCIE             EQU  H'0006'
ACKTIM           EQU  H'0007'


;----- TXBUF Bits -----------------------------------------------------
TXBUF0           EQU  H'0000'
TXBUF1           EQU  H'0001'
TXBUF2           EQU  H'0002'
TXBUF3           EQU  H'0003'
TXBUF4           EQU  H'0004'
TXBUF5           EQU  H'0005'
TXBUF6           EQU  H'0006'
TXBUF7           EQU  H'0007'


;----- DMABCH Bits -----------------------------------------------------
BC8              EQU  H'0000'
BC9              EQU  H'0001'


;----- DMABCL Bits -----------------------------------------------------
BC0              EQU  H'0000'
BC1              EQU  H'0001'
BC2              EQU  H'0002'
BC3              EQU  H'0003'
BC4              EQU  H'0004'
BC5              EQU  H'0005'
BC6              EQU  H'0006'
BC7              EQU  H'0007'


;----- RXADDRH Bits -----------------------------------------------------
RXADDR8          EQU  H'0000'
RXADDR9          EQU  H'0001'
RXADDR10         EQU  H'0002'
RXADDR11         EQU  H'0003'


;----- RXADDRL Bits -----------------------------------------------------
RXADDR0          EQU  H'0000'
RXADDR1          EQU  H'0001'
RXADDR2          EQU  H'0002'
RXADDR3          EQU  H'0003'
RXADDR4          EQU  H'0004'
RXADDR5          EQU  H'0005'
RXADDR6          EQU  H'0006'
RXADDR7          EQU  H'0007'


;----- TXADDRH Bits -----------------------------------------------------
TXADDR8          EQU  H'0000'
TXADDR9          EQU  H'0001'
TXADDR10         EQU  H'0002'
TXADDR11         EQU  H'0003'


;----- TXADDRL Bits -----------------------------------------------------
TXADDR0          EQU  H'0000'
TXADDR1          EQU  H'0001'
TXADDR2          EQU  H'0002'
TXADDR3          EQU  H'0003'
TXADDR4          EQU  H'0004'
TXADDR5          EQU  H'0005'
TXADDR6          EQU  H'0006'
TXADDR7          EQU  H'0007'


;----- PORTVP Bits -----------------------------------------------------
RVP0             EQU  H'0000'
RVP1             EQU  H'0001'
RVP2             EQU  H'0002'
RVP3             EQU  H'0003'
RVP4             EQU  H'0004'
RVP5             EQU  H'0005'
RVP6             EQU  H'0006'
RVP7             EQU  H'0007'


;----- LATVP Bits -----------------------------------------------------
LATVP0           EQU  H'0000'
LATVP1           EQU  H'0001'
LATVP2           EQU  H'0002'
LATVP3           EQU  H'0003'
LATVP4           EQU  H'0004'
LATVP5           EQU  H'0005'
LATVP6           EQU  H'0006'
LATVP7           EQU  H'0007'


;----- TRISVP Bits -----------------------------------------------------
TRISVP0          EQU  H'0000'
TRISVP1          EQU  H'0001'
TRISVP2          EQU  H'0002'
TRISVP3          EQU  H'0003'
TRISVP4          EQU  H'0004'
TRISVP5          EQU  H'0005'
TRISVP6          EQU  H'0006'
TRISVP7          EQU  H'0007'


;----- UADDR Bits -----------------------------------------------------
ADDR0            EQU  H'0000'
ADDR1            EQU  H'0001'
ADDR2            EQU  H'0002'
ADDR3            EQU  H'0003'
ADDR4            EQU  H'0004'
ADDR5            EQU  H'0005'
ADDR6            EQU  H'0006'


;----- UCON Bits -----------------------------------------------------
SUSPND           EQU  H'0001'
RESUME           EQU  H'0002'
USBEN            EQU  H'0003'
PKTDIS           EQU  H'0004'
SE0              EQU  H'0005'
PPBRST           EQU  H'0006'


;----- USTAT Bits -----------------------------------------------------
PPBI             EQU  H'0001'
DIR              EQU  H'0002'

ENDP0            EQU  H'0003'
ENDP1            EQU  H'0004'
ENDP2            EQU  H'0005'
ENDP3            EQU  H'0006'


;----- UEIR Bits -----------------------------------------------------
PIDEF            EQU  H'0000'
CRC5EF           EQU  H'0001'
CRC16EF          EQU  H'0002'
DFN8EF           EQU  H'0003'
BTOEF            EQU  H'0004'
BTSEF            EQU  H'0007'


;----- UIR Bits -----------------------------------------------------
URSTIF           EQU  H'0000'
UERRIF           EQU  H'0001'
ACTVIF           EQU  H'0002'
TRNIF            EQU  H'0003'
IDLEIF           EQU  H'0004'
STALLIF          EQU  H'0005'
SOFIF            EQU  H'0006'


;----- UFRMH Bits -----------------------------------------------------
FRM8             EQU  H'0000'
FRM9             EQU  H'0001'
FRM10            EQU  H'0002'


;----- UFRML Bits -----------------------------------------------------
FRM0             EQU  H'0000'
FRM1             EQU  H'0001'
FRM2             EQU  H'0002'
FRM3             EQU  H'0003'
FRM4             EQU  H'0004'
FRM5             EQU  H'0005'
FRM6             EQU  H'0006'
FRM7             EQU  H'0007'


;----- RCON4 Bits -----------------------------------------------------
PMSLP            EQU  H'0000'
DPSLP            EQU  H'0002'
SRETEN           EQU  H'0004'


;----- RCON3 Bits -----------------------------------------------------
VBAT             EQU  H'0000'
VBPOR            EQU  H'0001'
VDDPOR           EQU  H'0002'
VDDBOR           EQU  H'0003'
STKERR           EQU  H'0007'


;----- RCON2 Bits -----------------------------------------------------
SWDTEN           EQU  H'0005'
EXTR             EQU  H'0007'


;----- EECON1 Bits -----------------------------------------------------
WR               EQU  H'0001'
WREN             EQU  H'0002'
WRERR            EQU  H'0003'
FREE             EQU  H'0004'
WWPROG           EQU  H'0005'


